# pandas

#### Primary pandas objects:

- Series
- DataFrame

## Introduction to pd.Series

In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
s = pd.Series([1, 2, 3, 4])

In [ ]:
print(s)

In [ ]:
len(dir(s))

In [ ]:
list(s) # just to show you that first columnt above is just an index. Not our data.

In [ ]:
s[1]

In [ ]:
s[[0,3]]

In [ ]:
s = pd.Series([1,2,3,4], index=['a', 'b', 'c', 'd'])

In [ ]:
s

In [ ]:
s[['a','b']]

In [ ]:
s[[0,1]]

In [ ]:
s.index

In [ ]:
s * 2

In [ ]:
ax = s.plot.bar()
ax.set_xticklabels(s.index, rotation='horizontal')
plt.show()

In [ ]:
len(dir(s))

## Introduction to pd.DataFrame

In [11]:
d = {'A' : pd.Series([10,20,30,40]),
     'B' : [0.1, 0.2, 0.3, 0.4],
     'C' : np.array([3] * 4),
     'D' : ['jahody', 'python', 'lucie', 'fun']}

df = pd.DataFrame(d)

In [12]:
df

    A    B  C       D
0  10  0.1  3  jahody
1  20  0.2  3  python
2  30  0.3  3   lucie
3  40  0.4  3     fun

In [13]:
df.describe()

               A         B    C
count   4.000000  4.000000  4.0
mean   25.000000  0.250000  3.0
std    12.909944  0.129099  0.0
min    10.000000  0.100000  3.0
25%    17.500000  0.175000  3.0
50%    25.000000  0.250000  3.0
75%    32.500000  0.325000  3.0
max    40.000000  0.400000  3.0

In [14]:
print(type(d['A']))
print(type(d['B']))
print(type(d['C']))
print(type(d['D']))

<class 'pandas.core.series.Series'>
<class 'list'>
<class 'numpy.ndarray'>
<class 'list'>

In [15]:
df.dtypes

A      int64
B    float64
C      int64
D     object
dtype: object

In [16]:
df.head(2)

    A    B  C       D
0  10  0.1  3  jahody
1  20  0.2  3  python

In [17]:
df.tail(2)

    A    B  C      D
2  30  0.3  3  lucie
3  40  0.4  3    fun

In [18]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.values

array([[10, 0.1, 3, 'jahody'],
       [20, 0.2, 3, 'python'],
       [30, 0.3, 3, 'lucie'],
       [40, 0.4, 3, 'fun']], dtype=object)

In [22]:
df.T

        0       1      2    3
A      10      20     30   40
B     0.1     0.2    0.3  0.4
C       3       3      3    3
D  jahody  python  lucie  fun

In [ ]:
df.sort_index(axis=0, ascending=True)

In [ ]:
df.sort_values(by='D' , inplace=True)

In [ ]:
df

In [ ]:
len(dir(df))

### Selection by label

In [23]:
df

    A    B  C       D
0  10  0.1  3  jahody
1  20  0.2  3  python
2  30  0.3  3   lucie
3  40  0.4  3     fun

In [24]:
df['B']

0    0.1
1    0.2
2    0.3
3    0.4
Name: B, dtype: float64

In [25]:
df.A

0    10
1    20
2    30
3    40
Name: A, dtype: int64

In [26]:
type(df['A'])

pandas.core.series.Series

In [27]:
df[0:2] # slice the rows

    A    B  C       D
0  10  0.1  3  jahody
1  20  0.2  3  python

In [28]:
d = {'A' : pd.Series([10,20,30,40], index=['sample1', 'sample2', 'sample3', 'sample4']),
     'B' : [0.1, 0.2, 0.3, 0.4],
     'C' : np.array([3] * 4),
     'D' : ['jahody', 'python', 'lucie', 'fun']}

df = pd.DataFrame(d)

In [29]:
df

          A    B  C       D
sample1  10  0.1  3  jahody
sample2  20  0.2  3  python
sample3  30  0.3  3   lucie
sample4  40  0.4  3     fun

In [30]:
df.loc['sample2']

A        20
B       0.2
C         3
D    python
Name: sample2, dtype: object

In [ ]:
type(df.loc['sample2'])

In [ ]:
df.loc['sample2'][['B', 'C']]

In [ ]:
df.loc[:,['A','B']]

### Selection by position

In [ ]:
df

In [ ]:
df.iloc[0:2, 0:2]

### Boolean Indexing

In [31]:
df.A

sample1    10
sample2    20
sample3    30
sample4    40
Name: A, dtype: int64

In [32]:
df.A > 20

sample1    False
sample2    False
sample3     True
sample4     True
Name: A, dtype: bool

In [33]:
df[df.A > 20]

          A    B  C      D
sample3  30  0.3  3  lucie
sample4  40  0.4  3    fun

In [ ]:
df[[False, False, True, True]]

### Setting new column

In [ ]:
s1 = pd.Series([100,200,300,400], index=['sample1', 'sample2', 'sample3', 'sample4'])

In [ ]:
df['E'] = s1

In [ ]:
df

### Setting new row

In [ ]:
df

In [ ]:
df.loc[len(df)] = [40,0.5, 3, 'banana',400]

In [ ]:
df

In [ ]:
df.index = ['sample1', 'sample2', 'sample3', 'sample4', 'sample5']

In [ ]:
df

### Missing data

In [ ]:
s2 = pd.Series([1000,np.nan,3000,np.nan], index=['sample1', 'sample2', 'sample3', 'sample4'])

In [ ]:
df['F'] = s2

In [ ]:
df

In [ ]:
df.dropna(how='any')

In [ ]:
df.fillna(value='5000')

In [ ]:
pd.isnull(df)

### Operations

In [ ]:
df.mean()

#### Apply

In [ ]:
def double_plus_two(x):
    return (x*2)+2

In [ ]:
df

In [ ]:
df.A.apply(double_plus_two)

In [ ]:
df.A[df.A > 20].apply(double_plus_two)

In [ ]:
df.A.value_counts()

In [ ]:
df

### Reading data from different formats

In [34]:
titanic = pd.read_excel('titanic.xlsx')

In [35]:
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
titanic = pd.read_csv('titanic.csv')

In [ ]:
titanic.head(5)

http://pandas.pydata.org/pandas-docs/stable/10min.html